---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange.BoltDiameter
source: html/1030bec7-f126-7b70-e428-39a3e350b7d0.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```